kyledenobel/RGA_Code/analog_controller/lib/STM8L152K4T6.h
// ==================================
//  Register Define File STM8L152K4T6
//  Author: Kyle de Nobel
// ===================================


#ifndef STM8L152K4T6_H
#define STM8L152K4T6_H


#define DEF_8BIT_REG_AT(NAME,ADDRESS)   volatile unsigned char* NAME = (unsigned char*) ADDRESS

/**
 * @brief Sets the bit or bits in a register
 */
#define SET_BIT(REG, BIT)       (REG = REG | BIT)

/**
 * @brief Clears the bit or bits in a register
 */
#define CLEAR_BIT(REG, BIT)     (REG = REG & (~BIT))

/**
 * @brief Places data into register
 */
#define WRITE_REG(REG, DATA)    (REG = DATA)

#include "STM8L152.h"

/* ===================================== */
/* ======== peripheral typedefs ======== */
/* ===================================== */
// GPIO
typedef struct {
    volatile unsigned char ODR;
    volatile unsigned char IDR;
    volatile unsigned char DDR;
    volatile unsigned char CR1;
    volatile unsigned char CR2;
} gpio_typedef_t;


// Clock Control (CLK)
typedef struct {
    volatile unsigned char CKDIVR;          /* offset 0x00 */
    volatile unsigned char CRTCR;           /* offset 0x01 */
    volatile unsigned char ICKCR;           /* offset 0x02 */
    volatile unsigned char PCKENR1;         /* offset 0x03 */
    volatile unsigned char PCKENR2;         /* offset 0x04 */
    volatile unsigned char CCOR;            /* offset 0x05 */
    volatile unsigned char ECKCR;           /* offset 0x06 */
    volatile unsigned char SCSR;            /* offset 0x07 */
    volatile unsigned char SWR;             /* offset 0x08 */
    volatile unsigned char SWCR;            /* offset 0x09 */
    volatile unsigned char CSSR;            /* offset 0x0A */
    volatile unsigned char CBEEPR;          /* offset 0x0B */
    volatile unsigned char HSICALR;         /* offset 0x0C */
    volatile unsigned char HSITRIMR;        /* offset 0x0D */
    volatile unsigned char HSIUNLCKR;       /* offset 0x0E */
    volatile unsigned char REGCSR;          /* offset 0x0F */
} clock_typedef_t;


// Routing Interface (RI)
typedef struct {
    volatile unsigned char RESERVED;        
    volatile unsigned char ICR1;            /* offset 0x01 */
    volatile unsigned char ICR2;            /* offset 0x02 */
    volatile unsigned char IOIR1;           /* offset 0x03 */
    volatile unsigned char IOIR2;           /* offset 0x04 */
    volatile unsigned char IOIR3;           /* offset 0x05 */
    volatile unsigned char IOCMR1;          /* offset 0x06 */
    volatile unsigned char IOCMR2;          /* offset 0x07 */
    volatile unsigned char IOCMR3;          /* offset 0x08 */
    volatile unsigned char IOSR1;           /* offset 0x09 */
    volatile unsigned char IOSR2;           /* offset 0x0A */
    volatile unsigned char IOSR3;           /* offset 0x0B */
    volatile unsigned char IOGCR;           /* offset 0x0C */
    volatile unsigned char ASCR1;           /* offset 0x0D */
    volatile unsigned char ASCR2;           /* offset 0x0E */
    volatile unsigned char RCR;             /* offset 0x0F */
} ri_typedef_t;


// System Configuration Controller (SYSCFG)
typedef struct {
    volatile unsigned char RMPCR1;          /* offset 0x00 */
    volatile unsigned char RMPCR2;          /* offset 0x01 */
} syscfg_typedef_t;
// NOTE: this device does not have RMPCR3 register


// Software Priority (SPR)
typedef struct {
    volatile unsigned char SPR1;            /* offset 0x00 */
    volatile unsigned char SPR2;            /* offset 0x01 */
    volatile unsigned char SPR3;            /* offset 0x02 */
    volatile unsigned char SPR4;            /* offset 0x03 */
    volatile unsigned char SPR5;            /* offset 0x04 */
    volatile unsigned char SPR6;            /* offset 0x05 */
    volatile unsigned char SPR7;            /* offset 0x06 */
    volatile unsigned char SPR8;            /* offset 0x07 */
} spr_typedef_t;


// Extended Interrupt (EXTI)
typedef struct {
    volatile unsigned char CR1;             /* offset 0x00 */
    volatile unsigned char CR2;             /* offset 0x01 */
    volatile unsigned char CR3;             /* offset 0x02 */
    volatile unsigned char SR1;             /* offset 0x03 */
    volatile unsigned char SR2;             /* offset 0x04 */
    volatile unsigned char CONF1;           /* offset 0x05 */
} exti_typedef_t;


// Universal Synchronous/Asynchronous Receiver Transmitter (USART)
typedef struct {
    volatile unsigned char SR;
    volatile unsigned char DR;
    volatile unsigned char BRR1;
    volatile unsigned char BRR2;
    volatile unsigned char CR1;
    volatile unsigned char CR2;
    volatile unsigned char CR3;
    volatile unsigned char CR4;
    volatile unsigned char CR5;
    volatile unsigned char GTR;
    volatile unsigned char PSCR;
} usart_typedef_t;


// Serial Peripheral Interface (SPI)
typedef struct {
    volatile unsigned char CR1;
    volatile unsigned char CR2;
    volatile unsigned char ICR;
    volatile unsigned char SR;
    volatile unsigned char DR;
    volatile unsigned char CRCPR;
    volatile unsigned char RXCRCR;
    volatile unsigned char TXCRCR;
} spi_typedef_t;


// Timers - 8 bits
typedef struct {
    volatile unsigned char CR1;             /* offset 0x00 */ 
    volatile unsigned char CR2;             /* offset 0x01 */ 
    volatile unsigned char SMCR;            /* offset 0x02 */
    volatile unsigned char DER;             /* offset 0x03 */
    volatile unsigned char IER;             /* offset 0x04 */
    volatile unsigned char SR1;             /* offset 0x05 */
    volatile unsigned char EGR;             /* offset 0x06 */
    volatile unsigned char CNTR;            /* offset 0x07 */
    volatile unsigned char PSCR;            /* offset 0x08 */
    volatile unsigned char ARR;             /* offset 0x09 */
} timer_8_bit_typedef_t;


// Power
typedef struct {
    volatile unsigned char CSR1;            /* offset 0x00 */
    volatile unsigned char CSR2;            /* offset 0x01 */
} power_typedef_t;


// Reset
typedef struct {
    volatile unsigned char CR;              /* offset 0x00 */
    volatile unsigned char SR;              /* offset 0x01 */
} reset_typedef_t;


// ADC
typedef struct {
    volatile unsigned char CR1;             /* offset 0x00 */
    volatile unsigned char CR2;             /* offset 0x01 */
    volatile unsigned char CR3;             /* offset 0x02 */
    volatile unsigned char SR;              /* offset 0x03 */
    volatile unsigned char DRH;             /* offset 0x04 */
    volatile unsigned char DRL;             /* offset 0x05 */
    volatile unsigned char HTRH;            /* offset 0x06 */
    volatile unsigned char HTRL;            /* offset 0x07 */
    volatile unsigned char LTRH;            /* offset 0x08 */
    volatile unsigned char LTRL;            /* offset 0x09 */
    volatile unsigned char SQR1;            /* offset 0x0A */
    volatile unsigned char SQR2;            /* offset 0x0B */
    volatile unsigned char SQR3;            /* offset 0x0C */
    volatile unsigned char SQR4;            /* offset 0x0D */
    volatile unsigned char TRIGR1;          /* offset 0x0E */
    volatile unsigned char TRIGR2;          /* offset 0x0F */
    volatile unsigned char TRIGR3;          /* offset 0x10 */
    volatile unsigned char TRIGR4;          /* offset 0x11 */
} adc_typedef_t;


/* ===================================== */
/* ====== peripheral base defines ====== */
/* ===================================== */
// GPIO
#define GPIOA_BASE              0x5000
#define GPIOB_BASE              0x5005
#define GPIOC_BASE              0x500a
#define GPIOD_BASE              0x500f
#define GPIOE_BASE              0x5014
#define GPIOF_BASE              0x5019
// CLOCK CONTROL (CLK)
#define CLOCK_BASE              0x50c0
// ROUTING INTERFACE (RI)
#define RI_BAES                 0x5430
// SYSTEM CONFIGURATION CONTROLLER (SYSCFG)
#define SYSCFG_BASE             0x509e
// SOFTWARE PRIORITY (ITC)
#define SPR_BASE                0x7f70
// EXTENDED INTERRUPT (EXTI)
#define EXTI_BASE               0x50A0
// USART
#define USART_BASE              0x5230
// SPI
#define SPI_BASE                0x5200 
// Timer, 8-bit
#define TIM4_BASE               0x52E0
// Power
#define POWER_BASE              0x50B2
// Reset
#define RESET_BASE              0x50B0
// ADC
#define ADC_BASE                0x5340


/* ===================================== */
/* ========= peripheral defines ======== */
/* ===================================== */
// GPIO
#define GPIOA  ((gpio_typedef_t*) GPIOA_BASE)
#define GPIOB  ((gpio_typedef_t*) GPIOB_BASE)
#define GPIOC  ((gpio_typedef_t*) GPIOC_BASE)
#define GPIOD  ((gpio_typedef_t*) GPIOD_BASE)
#define GPIOE  ((gpio_typedef_t*) GPIOE_BASE)
#define GPIOF  ((gpio_typedef_t*) GPIOF_BASE)
// CLOCK CONTROL (CLK)
#define CLOCK  ((clock_typedef_t*) CLOCK_BASE)
// ROUTING INTERFACE (RI)
#define RI     ((ri_typedef_t*) RI_BAES)
// SYSTEM CONFIGURATION CONTROLLER (SYSCFG)
#define SYSCFG ((syscfg_typedef_t*) SYSCFG_BASE)
// SOFTWARE PRIORITY (SPR)
#define SPR    ((spr_typedef_t*) SPR_BASE)
// EXTENDED INTERRUPT (EXTI)
#define EXTI   ((exti_typedef_t*) EXTI_BASE)
// USART
#define USART  ((usart_typedef_t*) USART_BASE)
// SPI
#define SPI    ((spi_typedef_t*) SPI_BASE)
// Timer, 8-bit
#define TIM4   ((timer_8_bit_typedef_t*) TIM4_BASE)
// Power
#define POWER  ((power_typedef_t*) POWER_BASE)
// Reset
#define RESET  ((reset_typedef_t*) RESET_BASE)
// ADC
#define ADC    ((adc_typedef_t*) ADC_BASE)


/* ===================================== */
/* ====== Register Value Defines ======= */
/* ===================================== */

/* =============== GPIO ================ */
// ODR
#define GPIO_ODR_ODR0_OFFSET            0
#define GPIO_ODR_ODR0_MASK              0x01
#define GPIO_ODR_ODR0                   (GPIO_ODR_ODR0_MASK << GPIO_ODR_ODR0_OFFSET)
#define GPIO_ODR_ODR1_OFFSET            1
#define GPIO_ODR_ODR1_MASK              0x01
#define GPIO_ODR_ODR1                   (GPIO_ODR_ODR1_MASK << GPIO_ODR_ODR1_OFFSET)
#define GPIO_ODR_ODR2_OFFSET            2
#define GPIO_ODR_ODR2_MASK              0x01
#define GPIO_ODR_ODR2                   (GPIO_ODR_ODR2_MASK << GPIO_ODR_ODR2_OFFSET)
#define GPIO_ODR_ODR3_OFFSET            3
#define GPIO_ODR_ODR3_MASK              0x01
#define GPIO_ODR_ODR3                   (GPIO_ODR_ODR3_MASK << GPIO_ODR_ODR3_OFFSET)
#define GPIO_ODR_ODR4_OFFSET            4
#define GPIO_ODR_ODR4_MASK              0x01
#define GPIO_ODR_ODR4                   (GPIO_ODR_ODR4_MASK << GPIO_ODR_ODR4_OFFSET)
#define GPIO_ODR_ODR5_OFFSET            5
#define GPIO_ODR_ODR5_MASK              0x01
#define GPIO_ODR_ODR5                   (GPIO_ODR_ODR5_MASK << GPIO_ODR_ODR5_OFFSET)
#define GPIO_ODR_ODR6_OFFSET            6
#define GPIO_ODR_ODR6_MASK              0x01
#define GPIO_ODR_ODR6                   (GPIO_ODR_ODR6_MASK << GPIO_ODR_ODR6_OFFSET)
#define GPIO_ODR_ODR7_OFFSET            7
#define GPIO_ODR_ODR7_MASK              0x01
#define GPIO_ODR_ODR7                   (GPIO_ODR_ODR7_MASK << GPIO_ODR_ODR7_OFFSET)
// IDR
#define GPIO_IDR_IDR0_OFFSET            0
#define GPIO_IDR_IDR0_MASK              0x01
#define GPIO_IDR_IDR0                   (GPIO_IDR_IDR0_MASK << GPIO_IDR_IDR0_OFFSET)
#define GPIO_IDR_IDR1_OFFSET            1
#define GPIO_IDR_IDR1_MASK              0x01
#define GPIO_IDR_IDR1                   (GPIO_IDR_IDR1_MASK << GPIO_IDR_IDR1_OFFSET)
#define GPIO_IDR_IDR2_OFFSET            2
#define GPIO_IDR_IDR2_MASK              0x01
#define GPIO_IDR_IDR2                   (GPIO_IDR_IDR2_MASK << GPIO_IDR_IDR2_OFFSET)
#define GPIO_IDR_IDR3_OFFSET            3
#define GPIO_IDR_IDR3_MASK              0x01
#define GPIO_IDR_IDR3                   (GPIO_IDR_IDR3_MASK << GPIO_IDR_IDR3_OFFSET)
#define GPIO_IDR_IDR4_OFFSET            4
#define GPIO_IDR_IDR4_MASK              0x01
#define GPIO_IDR_IDR4                   (GPIO_IDR_IDR4_MASK << GPIO_IDR_IDR4_OFFSET)
#define GPIO_IDR_IDR5_OFFSET            5
#define GPIO_IDR_IDR5_MASK              0x01
#define GPIO_IDR_IDR5                   (GPIO_IDR_IDR5_MASK << GPIO_IDR_IDR5_OFFSET)
#define GPIO_IDR_IDR6_OFFSET            6
#define GPIO_IDR_IDR6_MASK              0x01
#define GPIO_IDR_IDR6                   (GPIO_IDR_IDR6_MASK << GPIO_IDR_IDR6_OFFSET)
#define GPIO_IDR_IDR7_OFFSET            7
#define GPIO_IDR_IDR7_MASK              0x01
#define GPIO_IDR_IDR7                   (GPIO_IDR_IDR7_MASK << GPIO_IDR_IDR7_OFFSET)
// DDR
#define GPIO_DDR_DDR0_OFFSET            0
#define GPIO_DDR_DDR0_MASK              0x01
#define GPIO_DDR_DDR0                   (GPIO_DDR_DDR0_MASK << GPIO_DDR_DDR0_OFFSET)
#define GPIO_DDR_DDR1_OFFSET            1
#define GPIO_DDR_DDR1_MASK              0x01
#define GPIO_DDR_DDR1                   (GPIO_DDR_DDR1_MASK << GPIO_DDR_DDR1_OFFSET)
#define GPIO_DDR_DDR2_OFFSET            2
#define GPIO_DDR_DDR2_MASK              0x01
#define GPIO_DDR_DDR2                   (GPIO_DDR_DDR2_MASK << GPIO_DDR_DDR2_OFFSET)
#define GPIO_DDR_DDR3_OFFSET            3
#define GPIO_DDR_DDR3_MASK              0x01
#define GPIO_DDR_DDR3                   (GPIO_DDR_DDR3_MASK << GPIO_DDR_DDR3_OFFSET)
#define GPIO_DDR_DDR4_OFFSET            4
#define GPIO_DDR_DDR4_MASK              0x01
#define GPIO_DDR_DDR4                   (GPIO_DDR_DDR4_MASK << GPIO_DDR_DDR4_OFFSET)
#define GPIO_DDR_DDR5_OFFSET            5
#define GPIO_DDR_DDR5_MASK              0x01
#define GPIO_DDR_DDR5                   (GPIO_DDR_DDR5_MASK << GPIO_DDR_DDR5_OFFSET)
#define GPIO_DDR_DDR6_OFFSET            6
#define GPIO_DDR_DDR6_MASK              0x01
#define GPIO_DDR_DDR6                   (GPIO_DDR_DDR6_MASK << GPIO_DDR_DDR6_OFFSET)
#define GPIO_DDR_DDR7_OFFSET            7
#define GPIO_DDR_DDR7_MASK              0x01
#define GPIO_DDR_DDR7                   (GPIO_DDR_DDR7_MASK << GPIO_DDR_DDR7_OFFSET)
// CR1
#define GPIO_CR1_CR10_OFFSET            0
#define GPIO_CR1_CR10_MASK              0x01
#define GPIO_CR1_CR10                   (GPIO_CR1_CR10_MASK << GPIO_CR1_CR10_OFFSET)
#define GPIO_CR1_CR11_OFFSET            1
#define GPIO_CR1_CR11_MASK              0x01
#define GPIO_CR1_CR11                   (GPIO_CR1_CR11_MASK << GPIO_CR1_CR11_OFFSET)
#define GPIO_CR1_CR12_OFFSET            2
#define GPIO_CR1_CR12_MASK              0x01
#define GPIO_CR1_CR12                   (GPIO_CR1_CR12_MASK << GPIO_CR1_CR12_OFFSET)
#define GPIO_CR1_CR13_OFFSET            3
#define GPIO_CR1_CR13_MASK              0x01
#define GPIO_CR1_CR13                   (GPIO_CR1_CR13_MASK << GPIO_CR1_CR13_OFFSET)
#define GPIO_CR1_CR14_OFFSET            4
#define GPIO_CR1_CR14_MASK              0x01
#define GPIO_CR1_CR14                   (GPIO_CR1_CR14_MASK << GPIO_CR1_CR14_OFFSET)
#define GPIO_CR1_CR15_OFFSET            5
#define GPIO_CR1_CR15_MASK              0x01
#define GPIO_CR1_CR15                   (GPIO_CR1_CR15_MASK << GPIO_CR1_CR15_OFFSET)
#define GPIO_CR1_CR16_OFFSET            6
#define GPIO_CR1_CR16_MASK              0x01
#define GPIO_CR1_CR16                   (GPIO_CR1_CR16_MASK << GPIO_CR1_CR16_OFFSET)
#define GPIO_CR1_CR17_OFFSET            7
#define GPIO_CR1_CR17_MASK              0x01
#define GPIO_CR1_CR17                   (GPIO_CR1_CR17_MASK << GPIO_CR1_CR17_OFFSET)
// CR2
#define GPIO_CR2_CR20_OFFSET            0
#define GPIO_CR2_CR20_MASK              0x01
#define GPIO_CR2_CR20                   (GPIO_CR2_CR20_MASK << GPIO_CR2_CR20_OFFSET)
#define GPIO_CR2_CR21_OFFSET            1
#define GPIO_CR2_CR21_MASK              0x01
#define GPIO_CR2_CR21                   (GPIO_CR2_CR21_MASK << GPIO_CR2_CR21_OFFSET)
#define GPIO_CR2_CR22_OFFSET            2
#define GPIO_CR2_CR22_MASK              0x01
#define GPIO_CR2_CR22                   (GPIO_CR2_CR22_MASK << GPIO_CR2_CR22_OFFSET)
#define GPIO_CR2_CR23_OFFSET            3
#define GPIO_CR2_CR23_MASK              0x01
#define GPIO_CR2_CR23                   (GPIO_CR2_CR23_MASK << GPIO_CR2_CR23_OFFSET)
#define GPIO_CR2_CR24_OFFSET            4
#define GPIO_CR2_CR24_MASK              0x01
#define GPIO_CR2_CR24                   (GPIO_CR2_CR24_MASK << GPIO_CR2_CR24_OFFSET)
#define GPIO_CR2_CR25_OFFSET            5
#define GPIO_CR2_CR25_MASK              0x01
#define GPIO_CR2_CR25                   (GPIO_CR2_CR25_MASK << GPIO_CR2_CR25_OFFSET)
#define GPIO_CR2_CR26_OFFSET            6
#define GPIO_CR2_CR26_MASK              0x01
#define GPIO_CR2_CR26                   (GPIO_CR2_CR26_MASK << GPIO_CR2_CR26_OFFSET)
#define GPIO_CR2_CR27_OFFSET            7
#define GPIO_CR2_CR27_MASK              0x01
#define GPIO_CR2_CR27                   (GPIO_CR2_CR27_MASK << GPIO_CR2_CR27_OFFSET)

