kyledenobel/RGA_Code/analog_controller/lib/STM8L152K4T6.h
/* =============== CLOCK ================ */
// CKDIVR
#define CLOCK_CKDIVR_CMK0_OFFSET        0
#define CLOCK_CKDIVR_CMK0_MASK          0x01
#define CLOCK_CKDIVR_CMK0               (CLOCK_CKDIVR_CMK0_MASK <<  CLOCK_CKDIVR_CMK0_OFFSET)
#define CLOCK_CKDIVR_CMK1_OFFSET        1
#define CLOCK_CKDIVR_CMK1_MASK          0x01
#define CLOCK_CKDIVR_CMK1               (CLOCK_CKDIVR_CMK1_MASK <<  CLOCK_CKDIVR_CMK1_OFFSET)
#define CLOCK_CKDIVR_CMK2_OFFSET        2
#define CLOCK_CKDIVR_CMK2_MASK          0x01
#define CLOCK_CKDIVR_CMK2               (CLOCK_CKDIVR_CMK2_MASK <<  CLOCK_CKDIVR_CMK2_OFFSET)
// CRTCR
#define CLOCK_CRTCR_RTCSWBSY_OFFSET     0
#define CLOCK_CRTCR_RTCSWBSY_MASK       0x01
#define CLOCK_CRTCR_RTCSWBSY            (CLOCK_CRTCR_RTCSWBSY_MASK << CLOCK_CRTCR_RTCSWBSY_OFFSET)
#define CLOCK_CRTCR_RTCSEL0_OFFSET      1
#define CLOCK_CRTCR_RTCSEL0_MASK        0x01
#define CLOCK_CRTCR_RTCSEL0             (CLOCK_CRTCR_RTCSEL0_MASK << CLOCK_CRTCR_RTCSEL0_OFFSET)
#define CLOCK_CRTCR_RTCSEL1_OFFSET      2
#define CLOCK_CRTCR_RTCSEL1_MASK        0x01
#define CLOCK_CRTCR_RTCSEL1             (CLOCK_CRTCR_RTCSEL1_MASK << CLOCK_CRTCR_RTCSEL1_OFFSET)
#define CLOCK_CRTCR_RTCSEL2_OFFSET      3
#define CLOCK_CRTCR_RTCSEL2_MASK        0x01
#define CLOCK_CRTCR_RTCSEL2             (CLOCK_CRTCR_RTCSEL2_MASK << CLOCK_CRTCR_RTCSEL2_OFFSET)
#define CLOCK_CRTCR_RTCSEL3_OFFSET      4
#define CLOCK_CRTCR_RTCSEL3_MASK        0x01
#define CLOCK_CRTCR_RTCSEL3             (CLOCK_CRTCR_RTCSEL3_MASK << CLOCK_CRTCR_RTCSEL3_OFFSET)
#define CLOCK_CRTCR_RTCDIV0_OFFSET      5
#define CLOCK_CRTCR_RTCDIV0_MASK        0x01
#define CLOCK_CRTCR_RTCDIV0             (CLOCK_CRTCR_RTCDIV0_MASK << CLOCK_CRTCR_RTCDIV0_OFFSET)
#define CLOCK_CRTCR_RTCDIV1_OFFSET      6
#define CLOCK_CRTCR_RTCDIV1_MASK        0x01
#define CLOCK_CRTCR_RTCDIV1             (CLOCK_CRTCR_RTCDIV1_MASK << CLOCK_CRTCR_RTCDIV1_OFFSET)
#define CLOCK_CRTCR_RTCDIV2_OFFSET      7
#define CLOCK_CRTCR_RTCDIV2_MASK        0x01
#define CLOCK_CRTCR_RTCDIV2             (CLOCK_CRTCR_RTCDIV2_MASK << CLOCK_CRTCR_RTCDIV2_OFFSET)
// ICKCR
#define CLOCK_ICKCR_HSION_OFFSET        0
#define CLOCK_ICKCR_HSION_MASK          0x01
#define CLOCK_ICKCR_HSION               (CLOCK_ICKCR_HSION_MASK << CLOCK_ICKCR_HSION_OFFSET)
#define CLOCK_ICKCR_HSIRDY_OFFSET       1
#define CLOCK_ICKCR_HSIRDY_MASK         0x01
#define CLOCK_ICKCR_HSIRDY              (CLOCK_ICKCR_HSIRDY_MASK <<CLOCK_ICKCR_HSIRDY_OFFSET)
#define CLOCK_ICKCR_LSION_OFFSET        2
#define CLOCK_ICKCR_LSION_MASK          0x01
#define CLOCK_ICKCR_LSION               (CLOCK_ICKCR_LSION_MASK <<CLOCK_ICKCR_LSION_OFFSET)
#define CLOCK_ICKCR_LSIRDY_OFFSET       3
#define CLOCK_ICKCR_LSIRDY_MASK         0x01
#define CLOCK_ICKCR_LSIRDY              (CLOCK_ICKCR_LSIRDY_MASK << CLOCK_ICKCR_LSIRDY_OFFSET)
#define CLOCK_ICKCR_SAHALT_OFFSET       4
#define CLOCK_ICKCR_SAHALT_MASK         0x01
#define CLOCK_ICKCR_SAHALT              (CLOCK_ICKCR_SAHALT_MASK << CLOCK_ICKCR_SAHALT_OFFSET)
#define CLOCK_ICKCR_FHW_OFFSET          5
#define CLOCK_ICKCR_FHW_MASK            0x01
#define CLOCK_ICKCR_FHW                 (CLOCK_ICKCR_FHW_MASK << CLOCK_ICKCR_FHW_OFFSET)
#define CLOCK_ICKCR_BEEPAHALT_OFFSET    6
#define CLOCK_ICKCR_BEEPAHALT_MASK      0x01
#define CLOCK_ICKCR_BEEPAHALT           (CLOCK_ICKCR_BEEPAHALT_MASK << CLOCK_ICKCR_BEEPAHALT_OFFSET)
// PCKENR1
#define CLOCK_PCKENR1_PCKEN10_OFFSET    0
#define CLOCK_PCKENR1_PCKEN10_MASK      0x01
#define CLOCK_PCKENR1_PCKEN10           (CLOCK_PCKENR1_PCKEN10_MASK << CLOCK_PCKENR1_PCKEN10_OFFSET)
#define CLOCK_PCKENR1_PCKEN11_OFFSET    1
#define CLOCK_PCKENR1_PCKEN11_MASK      0x01
#define CLOCK_PCKENR1_PCKEN11           (CLOCK_PCKENR1_PCKEN11_MASK << CLOCK_PCKENR1_PCKEN11_OFFSET)
#define CLOCK_PCKENR1_PCKEN12_OFFSET    2
#define CLOCK_PCKENR1_PCKEN12_MASK      0x01
#define CLOCK_PCKENR1_PCKEN12           (CLOCK_PCKENR1_PCKEN12_MASK << CLOCK_PCKENR1_PCKEN12_OFFSET)
#define CLOCK_PCKENR1_PCKEN13_OFFSET    3
#define CLOCK_PCKENR1_PCKEN13_MASK      0x01
#define CLOCK_PCKENR1_PCKEN13           (CLOCK_PCKENR1_PCKEN13_MASK << CLOCK_PCKENR1_PCKEN13_OFFSET)
#define CLOCK_PCKENR1_PCKEN14_OFFSET    4
#define CLOCK_PCKENR1_PCKEN14_MASK      0x01
#define CLOCK_PCKENR1_PCKEN14           (CLOCK_PCKENR1_PCKEN14_MASK << CLOCK_PCKENR1_PCKEN14_OFFSET)
#define CLOCK_PCKENR1_PCKEN15_OFFSET    5
#define CLOCK_PCKENR1_PCKEN15_MASK      0x01
#define CLOCK_PCKENR1_PCKEN15           (CLOCK_PCKENR1_PCKEN15_MASK << CLOCK_PCKENR1_PCKEN15_OFFSET)
#define CLOCK_PCKENR1_PCKEN16_OFFSET    6
#define CLOCK_PCKENR1_PCKEN16_MASK      0x01
#define CLOCK_PCKENR1_PCKEN16           (CLOCK_PCKENR1_PCKEN16_MASK << CLOCK_PCKENR1_PCKEN16_OFFSET)
#define CLOCK_PCKENR1_PCKEN17_OFFSET    0
#define CLOCK_PCKENR1_PCKEN17_MASK      0x01
#define CLOCK_PCKENR1_PCKEN17           (CLOCK_PCKENR1_PCKEN17_MASK << CLOCK_PCKENR1_PCKEN17_OFFSET)
// PCKENR2
#define CLOCK_PCKENR2_PCKEN20_OFFSET    0
#define CLOCK_PCKENR2_PCKEN20_MASK      0x01
#define CLOCK_PCKENR2_PCKEN20           (CLOCK_PCKENR2_PCKEN20_MASK << CLOCK_PCKENR2_PCKEN20_OFFSET)
#define CLOCK_PCKENR2_PCKEN21_OFFSET    1
#define CLOCK_PCKENR2_PCKEN21_MASK      0x01
#define CLOCK_PCKENR2_PCKEN21           (CLOCK_PCKENR2_PCKEN21_MASK << CLOCK_PCKENR2_PCKEN21_OFFSET)
#define CLOCK_PCKENR2_PCKEN22_OFFSET    2
#define CLOCK_PCKENR2_PCKEN22_MASK      0x01
#define CLOCK_PCKENR2_PCKEN22           (CLOCK_PCKENR2_PCKEN22_MASK << CLOCK_PCKENR2_PCKEN22_OFFSET)
#define CLOCK_PCKENR2_PCKEN23_OFFSET    3
#define CLOCK_PCKENR2_PCKEN23_MASK      0x01
#define CLOCK_PCKENR2_PCKEN23           (CLOCK_PCKENR2_PCKEN23_MASK << CLOCK_PCKENR2_PCKEN23_OFFSET)
#define CLOCK_PCKENR2_PCKEN24_OFFSET    4
#define CLOCK_PCKENR2_PCKEN24_MASK      0x01
#define CLOCK_PCKENR2_PCKEN24           (CLOCK_PCKENR2_PCKEN24_MASK << CLOCK_PCKENR2_PCKEN24_OFFSET)
#define CLOCK_PCKENR2_PCKEN25_OFFSET    5
#define CLOCK_PCKENR2_PCKEN25_MASK      0x01
#define CLOCK_PCKENR2_PCKEN25           (CLOCK_PCKENR2_PCKEN25_MASK << CLOCK_PCKENR2_PCKEN25_OFFSET)
#define CLOCK_PCKENR2_PCKEN27_OFFSET    7
#define CLOCK_PCKENR2_PCKEN27_MASK      0x01
#define CLOCK_PCKENR2_PCKEN27           (CLOCK_PCKENR2_PCKEN27_MASK << CLOCK_PCKENR2_PCKEN27_OFFSET)
// CCOR
#define CLOCK_CCOR_CCOSWBSY_OFFSET      0
#define CLOCK_CCOR_CCOSWBSY_MASK        0x01
#define CLOCK_CCOR_CCOSWBSY             (CLOCK_CCOR_CCOSWBSY_MASK << CLOCK_CCOR_CCOSWBSY_OFFSET)
#define CLOCK_CCOR_CCOSEL0_OFFSET       1
#define CLOCK_CCOR_CCOSEL0_MASK         0x01
#define CLOCK_CCOR_CCOSEL0              (CLOCK_CCOR_CCOSEL0_MASK << CLOCK_CCOR_CCOSEL0_OFFSET)
#define CLOCK_CCOR_CCOSEL1_OFFSET       2
#define CLOCK_CCOR_CCOSEL1_MASK         0x01
#define CLOCK_CCOR_CCOSEL1              (CLOCK_CCOR_CCOSEL1_MASK << CLOCK_CCOR_CCOSEL1_OFFSET)
#define CLOCK_CCOR_CCOSEL2_OFFSET       3
#define CLOCK_CCOR_CCOSEL2_MASK         0x01
#define CLOCK_CCOR_CCOSEL2              (CLOCK_CCOR_CCOSEL2_MASK << CLOCK_CCOR_CCOSEL2_OFFSET)
#define CLOCK_CCOR_CCOSEL3_OFFSET       4
#define CLOCK_CCOR_CCOSEL3_MASK         0x01
#define CLOCK_CCOR_CCOSEL3              (CLOCK_CCOR_CCOSEL3_MASK << CLOCK_CCOR_CCOSEL3_OFFSET)
#define CLOCK_CCOR_CCODIV0_OFFSET       5
#define CLOCK_CCOR_CCODIV0_MASK         0x01
#define CLOCK_CCOR_CCODIV0              (CLOCK_CCOR_CCODIV0_MASK << CLOCK_CCOR_CCODIV0_OFFSET)
#define CLOCK_CCOR_CCODIV1_OFFSET       6
#define CLOCK_CCOR_CCODIV1_MASK         0x01
#define CLOCK_CCOR_CCODIV1              (CLOCK_CCOR_CCODIV1_MASK << CLOCK_CCOR_CCODIV1_OFFSET)
#define CLOCK_CCOR_CCODIV2_OFFSET       7
#define CLOCK_CCOR_CCODIV2_MASK         0x01
#define CLOCK_CCOR_CCODIV2              (CLOCK_CCOR_CCODIV2_MASK << CLOCK_CCOR_CCODIV2_OFFSET)
// ECKCR
#define CLOCK_ECKCR_HSEON_OFFSET        0
#define CLOCK_ECKCR_HSEON_MASK          0x01
#define CLOCK_ECKCR_HSEON               (CLOCK_ECKCR_HSEON_MASK << CLOCK_ECKCR_HSEON_OFFSET)
#define CLOCK_ECKCR_HSERDY_OFFSET       1
#define CLOCK_ECKCR_HSERDY_MASK         0x01
#define CLOCK_ECKCR_HSERDY              (CLOCK_ECKCR_HSERDY_MASK << CLOCK_ECKCR_HSERDY_OFFSET)
#define CLOCK_ECKCR_LSEON_OFFSET        2
#define CLOCK_ECKCR_LSEON_MASK          0x01
#define CLOCK_ECKCR_LSEON               (CLOCK_ECKCR_LSEON_MASK << CLOCK_ECKCR_LSEON_OFFSET)
#define CLOCK_ECKCR_LSERDY_OFFSET       3
#define CLOCK_ECKCR_LSERDY_MASK         0x01
#define CLOCK_ECKCR_LSERDY              (CLOCK_ECKCR_LSERDY_MASK << CLOCK_ECKCR_LSERDY_OFFSET)
#define CLOCK_ECKCR_HSEBYP_OFFSET       4
#define CLOCK_ECKCR_HSEBYP_MASK         0x01
#define CLOCK_ECKCR_HSEBYP              (CLOCK_ECKCR_HSEBYP_MASK << CLOCK_ECKCR_HSEBYP_OFFSET)
#define CLOCK_ECKCR_LSEBYP_OFFSET       5
#define CLOCK_ECKCR_LSEBYP_MASK         0x01
#define CLOCK_ECKCR_LSEBYP              (CLOCK_ECKCR_LSEBYP_MASK << CLOCK_ECKCR_LSEBYP_OFFSET)
// SCSR
#define CLOCK_SCSR_CKM0_OFFSET          0
#define CLOCK_SCSR_CKM0_MASK            0x01
#define CLOCK_SCSR_CKM0                 (CLOCK_SCSR_CKM0_MASK << CLOCK_SCSR_CKM0_OFFSET)
#define CLOCK_SCSR_CKM1_OFFSET          1
#define CLOCK_SCSR_CKM1_MASK            0x01
#define CLOCK_SCSR_CKM1                 (CLOCK_SCSR_CKM1_MASK << CLOCK_SCSR_CKM1_OFFSET)
#define CLOCK_SCSR_CKM2_OFFSET          2
#define CLOCK_SCSR_CKM2_MASK            0x01
#define CLOCK_SCSR_CKM2                 (CLOCK_SCSR_CKM2_MASK << CLOCK_SCSR_CKM2_OFFSET)
#define CLOCK_SCSR_CKM3_OFFSET          3
#define CLOCK_SCSR_CKM3_MASK            0x01
#define CLOCK_SCSR_CKM3                 (CLOCK_SCSR_CKM3_MASK << CLOCK_SCSR_CKM3_OFFSET)
#define CLOCK_SCSR_CKM4_OFFSET          4
#define CLOCK_SCSR_CKM4_MASK            0x01
#define CLOCK_SCSR_CKM4                 (CLOCK_SCSR_CKM4_MASK << CLOCK_SCSR_CKM4_OFFSET)
#define CLOCK_SCSR_CKM5_OFFSET          5
#define CLOCK_SCSR_CKM5_MASK            0x01
#define CLOCK_SCSR_CKM5                 (CLOCK_SCSR_CKM5_MASK << CLOCK_SCSR_CKM5_OFFSET)
#define CLOCK_SCSR_CKM6_OFFSET          6
#define CLOCK_SCSR_CKM6_MASK            0x01
#define CLOCK_SCSR_CKM6                 (CLOCK_SCSR_CKM6_MASK << CLOCK_SCSR_CKM6_OFFSET)
#define CLOCK_SCSR_CKM7_OFFSET          7
#define CLOCK_SCSR_CKM7_MASK            0x01
#define CLOCK_SCSR_CKM7                 (CLOCK_SCSR_CKM7_MASK << CLOCK_SCSR_CKM7_OFFSET)
// SWR
#define CLOCK_SWR_SWI0_OFFSET           0
#define CLOCK_SWR_SWI0_MASK             0x01
#define CLOCK_SWR_SWI0                  (CLOCK_SWR_SWI0_MASK << CLOCK_SWR_SWI0_OFFSET)
#define CLOCK_SWR_SWI1_OFFSET           1
#define CLOCK_SWR_SWI1_MASK             0x01
#define CLOCK_SWR_SWI1                  (CLOCK_SWR_SWI1_MASK << CLOCK_SWR_SWI1_OFFSET)
#define CLOCK_SWR_SWI2_OFFSET           2
#define CLOCK_SWR_SWI2_MASK             0x01
#define CLOCK_SWR_SWI2                  (CLOCK_SWR_SWI2_MASK << CLOCK_SWR_SWI2_OFFSET)
#define CLOCK_SWR_SWI3_OFFSET           3
#define CLOCK_SWR_SWI3_MASK             0x01
#define CLOCK_SWR_SWI3                  (CLOCK_SWR_SWI3_MASK << CLOCK_SWR_SWI3_OFFSET)
#define CLOCK_SWR_SWI4_OFFSET           4
#define CLOCK_SWR_SWI4_MASK             0x01
#define CLOCK_SWR_SWI4                  (CLOCK_SWR_SWI4_MASK << CLOCK_SWR_SWI4_OFFSET)
#define CLOCK_SWR_SWI5_OFFSET           5
#define CLOCK_SWR_SWI5_MASK             0x01
#define CLOCK_SWR_SWI5                  (CLOCK_SWR_SWI5_MASK << CLOCK_SWR_SWI5_OFFSET)
#define CLOCK_SWR_SWI6_OFFSET           6
#define CLOCK_SWR_SWI6_MASK             0x01
#define CLOCK_SWR_SWI6                  (CLOCK_SWR_SWI6_MASK << CLOCK_SWR_SWI6_OFFSET)
#define CLOCK_SWR_SWI7_OFFSET           7
#define CLOCK_SWR_SWI7_MASK             0x01
#define CLOCK_SWR_SWI7                  (CLOCK_SWR_SWI7_MASK << CLOCK_SWR_SWI7_OFFSET)
// SWCR
#define CLOCK_SWCR_SWBSY_OFFSET         0
#define CLOCK_SWCR_SWBSY_MASK           0x01
#define CLOCK_SWCR_SWBSY                (CLOCK_SWCR_SWBSY_MASK << CLOCK_SWCR_SWBSY_OFFSET)
#define CLOCK_SWCR_SWEN_OFFSET          1
#define CLOCK_SWCR_SWEN_MASK            0x01
#define CLOCK_SWCR_SWEN                 (CLOCK_SWCR_SWEN_MASK << CLOCK_SWCR_SWEN_OFFSET)
#define CLOCK_SWCR_SWIEN_OFFSET         2
#define CLOCK_SWCR_SWIEN_MASK           0x01
#define CLOCK_SWCR_SWIEN                (CLOCK_SWCR_SWIEN_MASK << CLOCK_SWCR_SWIEN_OFFSET)
#define CLOCK_SWCR_SWIF_OFFSET          3
#define CLOCK_SWCR_SWIF_MASK            0x01
#define CLOCK_SWCR_SWIF                 (CLOCK_SWCR_SWIF_MASK << CLOCK_SWCR_SWIF_OFFSET)
// CSSR
#define CLOCK_CSSR_CSSEN_OFFSET         0
#define CLOCK_CSSR_CSSEN_MASK           0x01
#define CLOCK_CSSR_CSSEN                (CLOCK_CSSR_CSSEN_MASK << CLOCK_CSSR_CSSEN_OFFSET)
#define CLOCK_CSSR_AUX_OFFSET           1
#define CLOCK_CSSR_AUX_MASK             0x01
#define CLOCK_CSSR_AUX                  (CLOCK_CSSR_AUX_MASK << CLOCK_CSSR_AUX_OFFSET)
#define CLOCK_CSSR_CSSDIE_OFFSET        2
#define CLOCK_CSSR_CSSDIE_MASK          0x01
#define CLOCK_CSSR_CSSDIE               (CLOCK_CSSR_CSSDIE_MASK << CLOCK_CSSR_CSSDIE_OFFSET)
#define CLOCK_CSSR_CSSD_OFFSET          3
#define CLOCK_CSSR_CSSD_MASK            0x01
#define CLOCK_CSSR_CSSD                 (CLOCK_CSSR_CSSD_MASK << CLOCK_CSSR_CSSD_OFFSET)
#define CLOCK_CSSR_CSSDGON_OFFSET       4
#define CLOCK_CSSR_CSSDGON_MASK         0x01
#define CLOCK_CSSR_CSSDGON              (CLOCK_CSSR_CSSDGON_MASK << CLOCK_CSSR_CSSDGON_OFFSET)
// CBEEPR
#define CLOCK_CBEEPR_BEEPSWBSY_OFFSET   0
#define CLOCK_CBEEPR_BEEPSWBSY_MASK     0x01
#define CLOCK_CBEEPR_BEEPSWBSY          (CLOCK_CBEEPR_BEEPSWBSY_MASK << CLOCK_CBEEPR_BEEPSWBSY_OFFSET)
#define CLOCK_CBEEPR_CLKBEEPSEL0_OFFSET 1
#define CLOCK_CBEEPR_CLKBEEPSEL0_MASK   0x01
#define CLOCK_CBEEPR_CLKBEEPSEL0        (CLOCK_CBEEPR_CLKBEEPSEL0_MASK << CLOCK_CBEEPR_CLKBEEPSEL0_OFFSET)
#define CLOCK_CBEEPR_CLKBEEPSEL1_OFFSET 2
#define CLOCK_CBEEPR_CLKBEEPSEL1_MASK   0x01
#define CLOCK_CBEEPR_CLKBEEPSEL1        (CLOCK_CBEEPR_CLKBEEPSEL1_MASK << CLOCK_CBEEPR_CLKBEEPSEL1_OFFSET)
// HSICALR
#define CLOCK_SWR_HSICAL0_OFFSET        0
#define CLOCK_SWR_HSICAL0_MASK          0x01
#define CLOCK_SWR_HSICAL0               (CLOCK_SWR_HSICAL0_MASK << CLOCK_SWR_HSICAL0_OFFSET)
#define CLOCK_SWR_HSICAL1_OFFSET        1
#define CLOCK_SWR_HSICAL1_MASK          0x01
#define CLOCK_SWR_HSICAL1               (CLOCK_SWR_HSICAL1_MASK << CLOCK_SWR_HSICAL1_OFFSET)
#define CLOCK_SWR_HSICAL2_OFFSET        2
#define CLOCK_SWR_HSICAL2_MASK          0x01
#define CLOCK_SWR_HSICAL2               (CLOCK_SWR_HSICAL2_MASK << CLOCK_SWR_HSICAL2_OFFSET)
#define CLOCK_SWR_HSICAL3_OFFSET        3
#define CLOCK_SWR_HSICAL3_MASK          0x01
#define CLOCK_SWR_HSICAL3               (CLOCK_SWR_HSICAL3_MASK << CLOCK_SWR_HSICAL3_OFFSET)
#define CLOCK_SWR_HSICAL4_OFFSET        4
#define CLOCK_SWR_HSICAL4_MASK          0x01
#define CLOCK_SWR_HSICAL4               (CLOCK_SWR_HSICAL4_MASK << CLOCK_SWR_HSICAL4_OFFSET)
#define CLOCK_SWR_HSICAL5_OFFSET        5
#define CLOCK_SWR_HSICAL5_MASK          0x01
#define CLOCK_SWR_HSICAL5               (CLOCK_SWR_HSICAL5_MASK << CLOCK_SWR_HSICAL5_OFFSET)
#define CLOCK_SWR_HSICAL6_OFFSET        6
#define CLOCK_SWR_HSICAL6_MASK          0x01
#define CLOCK_SWR_HSICAL6               (CLOCK_SWR_HSICAL6_MASK << CLOCK_SWR_HSICAL6_OFFSET)
#define CLOCK_SWR_HSICAL7_OFFSET        7
#define CLOCK_SWR_HSICAL7_MASK          0x01
#define CLOCK_SWR_HSICAL7               (CLOCK_SWR_HSICAL7_MASK << CLOCK_SWR_HSICAL7_OFFSET)
// HSITRIMR
#define CLOCK_SWR_HSITRIMR0_OFFSET      0
#define CLOCK_SWR_HSITRIMR0_MASK        0x01
#define CLOCK_SWR_HSITRIMR0             (CLOCK_SWR_HSITRIMR0_MASK << CLOCK_SWR_HSITRIMR0_OFFSET)
#define CLOCK_SWR_HSITRIMR1_OFFSET      1
#define CLOCK_SWR_HSITRIMR1_MASK        0x01
#define CLOCK_SWR_HSITRIMR1             (CLOCK_SWR_HSITRIMR1_MASK << CLOCK_SWR_HSITRIMR1_OFFSET)
#define CLOCK_SWR_HSITRIMR2_OFFSET      2
#define CLOCK_SWR_HSITRIMR2_MASK        0x01
#define CLOCK_SWR_HSITRIMR2             (CLOCK_SWR_HSITRIMR2_MASK << CLOCK_SWR_HSITRIMR2_OFFSET)
#define CLOCK_SWR_HSITRIMR3_OFFSET      3
#define CLOCK_SWR_HSITRIMR3_MASK        0x01
#define CLOCK_SWR_HSITRIMR3             (CLOCK_SWR_HSITRIMR3_MASK << CLOCK_SWR_HSITRIMR3_OFFSET)
#define CLOCK_SWR_HSITRIMR4_OFFSET      4
#define CLOCK_SWR_HSITRIMR4_MASK        0x01
#define CLOCK_SWR_HSITRIMR4             (CLOCK_SWR_HSITRIMR4_MASK << CLOCK_SWR_HSITRIMR4_OFFSET)
#define CLOCK_SWR_HSITRIMR5_OFFSET      5
#define CLOCK_SWR_HSITRIMR5_MASK        0x01
#define CLOCK_SWR_HSITRIMR5             (CLOCK_SWR_HSITRIMR5_MASK << CLOCK_SWR_HSITRIMR5_OFFSET)
#define CLOCK_SWR_HSITRIMR6_OFFSET      6
#define CLOCK_SWR_HSITRIMR6_MASK        0x01
#define CLOCK_SWR_HSITRIMR6             (CLOCK_SWR_HSITRIMR6_MASK << CLOCK_SWR_HSITRIMR6_OFFSET)
#define CLOCK_SWR_HSITRIMR7_OFFSET      7
#define CLOCK_SWR_HSITRIMR7_MASK        0x01
#define CLOCK_SWR_HSITRIMR7             (CLOCK_SWR_HSITRIMR7_MASK << CLOCK_SWR_HSITRIMR7_OFFSET)
// HSIUNLCKR
#define CLOCK_SWR_HSIUNLCKR0_OFFSET     0
#define CLOCK_SWR_HSIUNLCKR0_MASK       0x01
#define CLOCK_SWR_HSIUNLCKR0            (CLOCK_SWR_HSIUNLCKR0_MASK << CLOCK_SWR_HSIUNLCKR0_OFFSET)
#define CLOCK_SWR_HSIUNLCKR1_OFFSET     1
#define CLOCK_SWR_HSIUNLCKR1_MASK       0x01
#define CLOCK_SWR_HSIUNLCKR1            (CLOCK_SWR_HSIUNLCKR1_MASK << CLOCK_SWR_HSIUNLCKR1_OFFSET)
#define CLOCK_SWR_HSIUNLCKR2_OFFSET     2
#define CLOCK_SWR_HSIUNLCKR2_MASK       0x01
#define CLOCK_SWR_HSIUNLCKR2            (CLOCK_SWR_HSIUNLCKR2_MASK << CLOCK_SWR_HSIUNLCKR2_OFFSET)
#define CLOCK_SWR_HSIUNLCKR3_OFFSET     3
#define CLOCK_SWR_HSIUNLCKR3_MASK       0x01
#define CLOCK_SWR_HSIUNLCKR3            (CLOCK_SWR_HSIUNLCKR3_MASK << CLOCK_SWR_HSIUNLCKR3_OFFSET)
#define CLOCK_SWR_HSIUNLCKR4_OFFSET     4
#define CLOCK_SWR_HSIUNLCKR4_MASK       0x01
#define CLOCK_SWR_HSIUNLCKR4            (CLOCK_SWR_HSIUNLCKR4_MASK << CLOCK_SWR_HSIUNLCKR4_OFFSET)
#define CLOCK_SWR_HSIUNLCKR5_OFFSET     5
#define CLOCK_SWR_HSIUNLCKR5_MASK       0x01
#define CLOCK_SWR_HSIUNLCKR5            (CLOCK_SWR_HSIUNLCKR5_MASK << CLOCK_SWR_HSIUNLCKR5_OFFSET)
#define CLOCK_SWR_HSIUNLCKR6_OFFSET     6
#define CLOCK_SWR_HSIUNLCKR6_MASK       0x01
#define CLOCK_SWR_HSIUNLCKR6            (CLOCK_SWR_HSIUNLCKR6_MASK << CLOCK_SWR_HSIUNLCKR6_OFFSET)
#define CLOCK_SWR_HSIUNLCKR7_OFFSET     7
#define CLOCK_SWR_HSIUNLCKR7_MASK       0x01
#define CLOCK_SWR_HSIUNLCKR7            (CLOCK_SWR_HSIUNLCKR7_MASK << CLOCK_SWR_HSIUNLCKR7_OFFSET)
// REGCSR
#define CLOCK_REGCSR_REGREADY_OFFSET    0
#define CLOCK_REGCSR_REGREADY_MASK      0x01
#define CLOCK_REGCSR_REGREADY           (CLOCK_REGCSR_REGREADY_MASK << CLOCK_REGCSR_REGREADY_OFFSET)
#define CLOCK_REGCSR_REGOFF_OFFSET      1
#define CLOCK_REGCSR_REGOFF_MASK        0x01
#define CLOCK_REGCSR_REGOFF             (CLOCK_REGCSR_REGOFF_MASK << CLOCK_REGCSR_REGOFF_OFFSET)
#define CLOCK_REGCSR_HSIPD_OFFSET       2
#define CLOCK_REGCSR_HSIPD_MASK         0x01
#define CLOCK_REGCSR_HSIPD              (CLOCK_REGCSR_HSIPD_MASK << CLOCK_REGCSR_HSIPD_OFFSET)
#define CLOCK_REGCSR_LSIPD_OFFSET       3
#define CLOCK_REGCSR_LSIPD_MASK         0x01
#define CLOCK_REGCSR_LSIPD              (CLOCK_REGCSR_LSIPD_MASK << CLOCK_REGCSR_LSIPD_OFFSET)
#define CLOCK_REGCSR_HSEPD_OFFSET       4
#define CLOCK_REGCSR_HSEPD_MASK         0x01
#define CLOCK_REGCSR_HSEPD              (CLOCK_REGCSR_HSEPD_MASK << CLOCK_REGCSR_HSEPD_OFFSET)
#define CLOCK_REGCSR_LSEPD_OFFSET       5
#define CLOCK_REGCSR_LSEPD_MASK         0x01
#define CLOCK_REGCSR_LSEPD              (CLOCK_REGCSR_LSEPD_MASK << CLOCK_REGCSR_LSEPD_OFFSET)
#define CLOCK_REGCSR_EEBUSY_OFFSET      6
#define CLOCK_REGCSR_EEBUSY_MASK        0x01
#define CLOCK_REGCSR_EEBUSY             (CLOCK_REGCSR_EEBUSY_MASK << CLOCK_REGCSR_EEBUSY_OFFSET)
#define CLOCK_REGCSR_EEREADY_OFFSET     7
#define CLOCK_REGCSR_EEREADY_MASK       0x01
#define CLOCK_REGCSR_EEREADY            (CLOCK_REGCSR_EEREADY_MASK << CLOCK_REGCSR_EEREADY_OFFSET)

/* ================ RI ================= */





#endif